[Killed] StringLiteral
Sites/noriste/bitcoin-address-soft-regex-validation/index.js:2:17
 const mainnet = "mainnet";
-const testnet = "testnet";
+const testnet = "";
 
 const mainnetRegex = /^(bc1|[13])[a-zA-HJ-NP-Z0-9]{25,39}$/;

[Killed] Block
Sites/noriste/bitcoin-address-soft-regex-validation/index.js:13:44
 * @param {string} address The Bitcoin address to validate
 * @returns {("mainnet"|"testnet"|undefined)}
 */
-const isValidBitcoinAddress = (address) => {
-    // @see http://mokagio.github.io/tech-journal/2014/11/21/regex-bitcoin.html
-    // @see https://stackoverflow.com/a/48643915
-    // mixed together here https://regex101.com/r/v0g6bv/1
-
-    // mainnet addresses
-    if(mainnetRegex.test(address)) {
-        return mainnet;
-    }
-    // testnet addresses
-    if(testnetRegex.test(address)) {
-        return testnet;
-    }
-
-    return undefined;
-};
+const isValidBitcoinAddress = (address) => {};
 
 module.exports = {

[Killed] IfStatement
Sites/noriste/bitcoin-address-soft-regex-validation/index.js:19:8
     // mixed together here https://regex101.com/r/v0g6bv/1
 
     // mainnet addresses
-    if(mainnetRegex.test(address)) {
+    if(true) {
         return mainnet;
     }

[Killed] Block
Sites/noriste/bitcoin-address-soft-regex-validation/index.js:19:36
     // mixed together here https://regex101.com/r/v0g6bv/1
 
     // mainnet addresses
-    if(mainnetRegex.test(address)) {
-        return mainnet;
-    }
+    if(mainnetRegex.test(address)) {}
     // testnet addresses
     if(testnetRegex.test(address)) {

[Killed] IfStatement
Sites/noriste/bitcoin-address-soft-regex-validation/index.js:23:8
         return mainnet;
     }
     // testnet addresses
-    if(testnetRegex.test(address)) {
+    if(true) {
         return testnet;
     }

[Killed] Block
Sites/noriste/bitcoin-address-soft-regex-validation/index.js:23:36
         return mainnet;
     }
     // testnet addresses
-    if(testnetRegex.test(address)) {
-        return testnet;
-    }
+    if(testnetRegex.test(address)) {}
 
     return undefined;
